/*----------------------------------------------------------------------------------------------------*/
/*  프로그램ID    : ACSAC공헌이익.sql                                                                 */
/*  프로그램명    : 공헌이익 적재처리 (변경적재)                                                      */
/*  최초  작성    : 2005-01-24   고요한                                                               */
/*  최종  변경    : 2005-01-24   고요한                                                               */
/*  DECLARE       : ACSAC공헌이익.declare                                                            */
/*                                                                                                    */
/*  SOURCE TABLE  : DM.월개인본인회원실적                                                             */
/*                  DW.월채권잔액                                                                     */
/*                  DW.월복수카드이용실적                                                             */
/*                  DW.월개인회원정보                                                                 */
/*                  ACRM.CRM단가                                                                      */
/*  TARGET TABLE  : ACRM.PV                                                                           */
/*  LOCAL TEMP    : TEMP_월개인본인회원실적 (모수기준)                                                */
/*                  TEMP_월채권잔액                                                                   */
/*                                                                                                    */
/*                                                                                                    */
/*  참조TABLE     :                                                                                   */
/*                                                                                                    */
/*  변경이력      : 2005-04-26 김수연  								      */
/*		    현재 기준: 본인회원실적 테이블의 전체 금액 들어가 있음.			      */
/*                  변경: 신용카드의 대손을 감안한 공헌이익을 구하는 것이므로,			      */
/*                  신용카드 회원 & 리스크등급 존재하는 회원 및 관련금액에 대해 산정                  */
/*----------------------------------------------------------------------------------------------------*/



--call sp_dmjob('공헌이익','S');  -- S

--     1) DM.월개인회원실적의 해당월 이용금액,건수,수수료 합계


     
     INSERT  INTO TEMPACRM_월개인본인회원실적합계
             (
                이용금액_개인_일시불            ,
                이용금액_개인_할부              ,
                이용금액_개인_CA                ,
                이용금액_개인_정상론            ,
                가맹점수수료_개인_일시불        ,
                가맹점수수료_개인_할부          ,
                수수료_개인_CA_취급             ,
                수수료_개인_CA_거래             ,
                수수료_개인_정상론_취급         ,
                수수료_개인_정상론_거래         ,
                수수료_개인_할부                ,
                수수료_개인_CA_이용             ,
                수수료_개인_정상론_이용         ,
                이용건수_개인_일시불            ,
                이용건수_개인_할부              ,
                이용건수_개인_CA		,
                이용건수_개인_정상론		,
                이용회원수_일시불       	,
                이용회원수_할부         	,
                이용회원수_CA           	,
                이용회원수_정상론       	,
                이용회원수_신판         	,
                이용회원수_기본
             )
      SELECT
              SUM(이용금액_개인본인_일시불    )                          AS 이용금액_개인_일시불
            , SUM(이용금액_개인본인_할부      )                          AS 이용금액_개인_할부
            , SUM(이용금액_개인본인_CA        )                          AS 이용금액_개인_CA
            , SUM(이용금액_개인본인_정상론    )                          AS 이용금액_개인_정상론
            , SUM(가맹점수수료_개인본인_일시불)                          AS 가맹점수수료_개인_일시불
            , SUM(가맹점수수료_개인본인_할부  )                          AS 가맹점수수료_개인_할부
            , SUM(수수료_개인본인_CA_취급     )                          AS 수수료_개인_CA_취급
            , SUM(수수료_개인본인_CA_거래     )                          AS 수수료_개인_CA_거래
            , SUM(수수료_개인본인_정상론_취급 )                          AS 수수료_개인_정상론_취급
            , SUM(수수료_개인본인_정상론_거래 )                          AS 수수료_개인_정상론_거래
            , SUM(수수료_개인본인_할부        )                          AS 수수료_개인_할부
            , SUM(수수료_개인본인_CA_이용     )                          AS 수수료_개인_CA_이용
            , SUM(수수료_개인본인_정상론_이용 )                          AS 수수료_개인_정상론_이용
            , SUM(이용건수_개인본인_일시불    )                          AS 이용건수_개인_일시불
            , SUM(이용건수_개인본인_할부      )                          AS 이용건수_개인_할부
            , SUM(이용건수_개인본인_CA        )                          AS 이용건수_개인_CA
            , SUM(이용건수_개인본인_정상론    )                          AS 이용건수_개인_정상론
            , SUM(CASE WHEN 이용여부_일시불  = 1 THEN 1 ELSE 0 END)  	 AS 이용회원수_일시불
            , SUM(CASE WHEN 이용여부_할부    = 1 THEN 1 ELSE 0 END)  	 AS 이용회원수_할부
            , SUM(CASE WHEN 이용여부_CA      = 1 THEN 1 ELSE 0 END)  	 AS 이용회원수_CA
            , SUM(CASE WHEN 이용여부_정상론  = 1 THEN 1 ELSE 0 END)  	 AS 이용회원수_정상론
            , SUM(CASE WHEN 이용여부_신판    = 1 THEN 1 ELSE 0 END)  	 AS 이용회원수_신판
            , SUM(CASE WHEN 이용여부_기본    = 1 THEN 1 ELSE 0 END)  	 AS 이용회원수_기본

        FROM  DM.월개인본인회원실적  
       WHERE  기준년월   = '$1' 
       AND    본인가족구분코드_발급기준 <>'4'
       AND    리스크등급<>'';

      COMMIT;


--call sp_dmjob('공헌이익');  -- 1



--     3) DM.월개인본인회원실적과 DM.월채권잔액의 연체회차 고객등급 적재. (대손추출)

     
     INSERT  INTO TEMPACRM_RP대손율
             (
                고객번호                                ,
                리스크등급                              ,
                이용금액_개인본인_일시불                ,
                이용금액_개인본인_할부                  ,
                이용금액_개인본인_CA                    ,
                이용금액_개인본인_정상론                ,
                RP대손율_일시불                         ,
                RP대손율_할부                           ,
                RP대손율_CA                             ,
                RP대손율_정상론
             )
      SELECT
              T1.고객번호                                                       AS 고객번호
            , T1.리스크등급                                                     AS 리스크등급
            , T1.이용금액_개인본인_일시불                                       AS 이용금액_개인본인_일시불
            , T1.이용금액_개인본인_할부                                         AS 이용금액_개인본인_할부
            , T1.이용금액_개인본인_CA                                           AS 이용금액_개인본인_CA
            , T1.이용금액_개인본인_정상론                                       AS 이용금액_개인본인_정상론
            , 0                                                                 AS RP대손율_일시불
            , 0                                                                 AS RP대손율_할부
            , 0                                                                 AS RP대손율_CA
            , 0                                                                 AS RP대손율_정상론

        FROM  DM.월개인본인회원실적  T1
       WHERE  T1.기준년월  = '$1'  
       AND    T1.본인가족구분코드_발급기준 <>'4'
       AND    T1.리스크등급<>'';

      COMMIT;

--call sp_dmjob('공헌이익');  -- 3



--     4) TEMPACRM_RP대손율에 대손율 UPDATE(1)

      -- 일시불
      UPDATE  TEMPACRM_RP대손율
    RP대손율_일시불 := T2.대손율_일시불

       FROM   TEMPACRM_RP대손율    T1 ,
              ACRM.CRMRP대손율     T2
      WHERE   T2.기준년월                     = '$1'
        AND   T1.리스크등급                   = T2.리스크등급 ;

      COMMIT;


      -- 할부
      UPDATE  TEMPACRM_RP대손율
    RP대손율_할부 := T2.대손율_할부

       FROM   TEMPACRM_RP대손율    T1 ,
              ACRM.CRMRP대손율         T2
      WHERE   T2.기준년월                     = '$1'
        AND   T1.리스크등급                     = T2.리스크등급 ;

      COMMIT;


      -- CA
      UPDATE  TEMPACRM_RP대손율
    RP대손율_CA := T2.대손율_CA

       FROM   TEMPACRM_RP대손율    T1 ,
              ACRM.CRMRP대손율         T2
      WHERE   T2.기준년월                     = '$1'
        AND   T1.리스크등급                     = T2.리스크등급 ;

      COMMIT;


      -- 정상론
      UPDATE  TEMPACRM_RP대손율
    RP대손율_정상론 := T2.대손율_카드론

       FROM   TEMPACRM_RP대손율    T1 ,
              ACRM.CRMRP대손율         T2
      WHERE   T2.기준년월                     = '$1'
        AND   T1.리스크등급                     = T2.리스크등급 ;

      COMMIT;


--call sp_dmjob('공헌이익');  -- 4


--     5) 대손율합계 적재

     
     INSERT  INTO TEMPACRM_대손비용
             (
              대손충당비용_일시불           ,
              대손충당비용_할부             ,
              대손충당비용_CA               ,
              대손충당비용_정상론
             )
      SELECT
              SUM(이용금액_개인본인_일시불 * RP대손율_일시불)                                     AS 대손충당비용_일시불
            , SUM(이용금액_개인본인_할부   * RP대손율_할부  )                                     AS 대손충당비용_할부
            , SUM(이용금액_개인본인_CA     * RP대손율_CA    )                                     AS 대손충당비용_CA
            , SUM(이용금액_개인본인_정상론 * RP대손율_정상론)                                     AS 대손충당비용_정상론

        FROM  TEMPACRM_RP대손율   ;

      COMMIT;

--call sp_dmjob('공헌이익');  -- 5


------------------------------------------------------------------------------------------------------
--   STEP 6.
--     1) TARGET TABLE DELETE
------------------------------------------------------------------------------------------------------



      DELETE
        FROM  ACRM.공헌이익
       WHERE  기준년월 = '$1';
    delete_cnt := SQL%ROWCOUNT;

      COMMIT;

--call sp_dmjob('공헌이익');  -- 6

------------------------------------------------------------------------------------------------------
--   STEP 7.
--     1) TARGET TABLE 적재
------------------------------------------------------------------------------------------------------

     INSERT  INTO ACRM.공헌이익
             (
		기준년월			,
		이용금액_개인_일시불		,
		이용금액_개인_할부              ,
		이용금액_개인_CA                ,
		이용금액_개인_정상론            ,
		가맹점수수료_일시불         ,
		가맹점수수료_할부           ,
		취급수수료_CA                   ,
		취급수수료_정상론               ,
		이용수수료_할부                       ,
		이용수수료_CA                         ,
		이용수수료_정상론                     ,
		금융비용_일시불                 ,
		금융비용_할부                   ,
		금융비용_CA                     ,
		금융비용_정상론                 ,
		승인비용_일시불                 ,
		승인비용_할부                   ,
		매입비용_일시불                 ,
		매입비용_할부                   ,
		청구비용_일시불                 ,
		청구비용_할부                   ,
		청구비용_CA                     ,
		청구비용_정상론                 ,
		청구비용_신판                   ,
		청구비용_기본                   ,
		입금비용_일시불                 ,
		입금비용_할부                   ,
		입금비용_CA                     ,
		입금비용_정상론                 ,
		입금비용_신판                   ,
		입금비용_기본                   ,
		PROCESS비용_일시불              ,
		PROCESS비용_할부                ,
		PROCESS비용_CA                  ,
		PROCESS비용_정상론              ,
		PROCESS비용_신판                ,
		PROCESS비용_기본                ,
		M포인트비용_일시불              ,
		M포인트비용_할부                ,
		마일리지비용_일시불             ,
		마일리지비용_할부               ,
		할인서비스_일시불               ,
		할인서비스_할부                 ,
		판촉서비스수수료_일시불         ,
		판촉서비스수수료_할부           ,
		브랜드로열티_일시불             ,
		브랜드로열티_할부               ,
		브랜드로열티_CA                 ,
		자금이체수수료_정상론           ,
		상품서비스비용_일시불           ,
		상품서비스비용_할부             ,
		대손충당비용_일시불                 ,
		대손충당비용_할부                   ,
		대손충당비용_CA                     ,
		대손충당비용_정상론                 ,
		공헌이익_일시불                 ,
		공헌이익_할부                   ,
		공헌이익_CA                     ,
		공헌이익_정상론                 ,
		공헌이익_신판                   ,
		공헌이익_기본                   ,
		공헌이익율_일시불               ,
		공헌이익율_할부                 ,
		공헌이익율_CA                   ,
		공헌이익율_정상론               ,
		공헌이익율_신판                 ,
		공헌이익율_기본			,
		DM적재일시
             )
      SELECT
             '$1'	                                                                            			AS 기준년월
            , T1.이용금액_개인_일시불                                                           			AS 이용금액_개인_일시불
            , T1.이용금액_개인_할부                                                             			AS 이용금액_개인_할부
            , T1.이용금액_개인_CA                                                               			AS 이용금액_개인_CA
            , T1.이용금액_개인_정상론                                                           			AS 이용금액_개인_정상론
            , T1.가맹점수수료_개인_일시불                                                       			AS 가맹점수수료_개인_일시불
            , T1.가맹점수수료_개인_할부                                                         			AS 가맹점수수료_개인_할부
            , T1.수수료_개인_CA_취급     + T1.수수료_개인_CA_거래                               			AS 취급수수료_CA
            , T1.수수료_개인_정상론_취급 + T1.수수료_개인_정상론_거래                           			AS 취급수수료_정상론
            , T1.수수료_개인_할부                                                               			AS 이용수수료_할부
            , T1.수수료_개인_CA_이용                                                            			AS 이용수수료_CA
            , T1.수수료_개인_정상론_이용                                                        			AS 이용수수료_정상론
            , T1.이용금액_개인_일시불  *  (cast(T4.신용공여기간_일시불 as NUMBER(9,6))      / 365 ) * T4.차입이자    	AS 금융비용_일시불
            , T1.이용금액_개인_할부    * ((cast(T4.신용공여기간_할부 as NUMBER(9,6))   + 1) / 24  ) * T4.차입이자    	AS 금융비용_할부
            , T1.이용금액_개인_CA      *  (cast(T4.신용공여기간_CA  as NUMBER(9,6))         / 365 ) * T4.차입이자    	AS 금융비용_CA
            , T1.이용금액_개인_정상론  * ((cast(T4.신용공여기간_카드론 as NUMBER(9,6)) + 1) / 24  ) * T4.차입이자    	AS 금융비용_정상론
            , T1.이용건수_개인_일시불  * T4.거래승인비용                                        			AS 승인비용_일시불
            , T1.이용건수_개인_할부    * T4.거래승인비용                                        			AS 승인비용_할부
            , T1.이용건수_개인_일시불  * T4.전표매입비용                                        			AS 매입비용_일시불
            , T1.이용건수_개인_할부    * T4.전표매입비용                                        			AS 매입비용_할부
            , T1.이용회원수_일시불     * T4.청구비용									AS 청구비용_일시불
            , T1.이용회원수_할부       * T4.청구비용 * T4.신용공여기간_할부                     			AS 청구비용_할부  
            , T1.이용회원수_CA         * T4.청구비용                                            			AS 청구비용_CA    
            , T1.이용회원수_정상론     * T4.청구비용 * T4.신용공여기간_카드론                   			AS 청구비용_정상론
            , (T1.이용회원수_신판 - T1.이용회원수_할부 + T1.이용회원수_할부 * T4.신용공여기간_할부) * T4.청구비용       AS 청구비용_신판  
            , (T1.이용회원수_기본 - T1.이용회원수_할부 + T1.이용회원수_할부 * T4.신용공여기간_할부) * T4.청구비용       AS 청구비용_기본
            , 0														AS 입금비용_일시불                 
            , 0														AS 입금비용_할부                   
            , 0														AS 입금비용_CA                     
            , 0														AS 입금비용_정상론                 
            , 0														AS 입금비용_신판                   
            , 0														AS 입금비용_기본                   
            , 0														AS PROCESS비용_일시불              
            , 0														AS PROCESS비용_할부                
            , 0														AS PROCESS비용_CA                  
            , 0														AS PROCESS비용_정상론              
            , 0														AS PROCESS비용_신판                
            , 0														AS PROCESS비용_기본                
            , T1.이용금액_개인_일시불 * T4.M적립취급비중_일시불    * T4.M포인트비율_일시불				AS M포인트비용_일시불              
            , T1.이용금액_개인_할부   * T4.M적립취급비중_할부      * T4.M포인트비율_할부 				AS M포인트비용_할부
            , T1.이용금액_개인_일시불 * T4.마일리지취급비중_일시불 * T4.마일리지비율_일시불				AS 마일리지비용_일시불             
            , T1.이용금액_개인_할부   * T4.마일리지취급비중_할부   * T4.마일리지비율_할부				AS 마일리지비용_할부               
            , T1.이용금액_개인_일시불 * T4.할인서비스비율    								AS 할인서비스_일시불               
            , T1.이용금액_개인_할부   * T4.할인서비스비율      								AS 할인서비스_할부                 
            , T1.이용금액_개인_일시불 * T4.판촉서비스비율 								AS 판촉서비스수수료_일시불         
            , T1.이용금액_개인_할부   * T4.판촉서비스비율   								AS 판촉서비스수수료_할부           
            , T1.이용금액_개인_일시불 * T4.브랜드로얄티비율_일시불							AS 브랜드로열티_일시불             
            , T1.이용금액_개인_할부   * T4.브랜드로얄티비율_할부   							AS 브랜드로열티_할부               
            , T1.이용금액_개인_CA     * T4.브랜드로얄티비율_CA   							AS 브랜드로열티_CA                 
            , T1.이용건수_개인_정상론 * T4.자금이체수수료   								AS 자금이체수수료_정상론           
            , 0														AS 상품서비스비용_일시불           
            , 0														AS 상품서비스비용_할부             
            , T3.대손충당비용_일시불											AS 대손충당비용_일시불                 
            , T3.대손충당비용_할부  											AS 대손충당비용_할부                   
            , T3.대손충당비용_CA    											AS 대손충당비용_CA                     
            , T3.대손충당비용_정상론											AS 대손충당비용_정상론                 
            , 0														AS 공헌이익_일시불                 
            , 0														AS 공헌이익_할부                   
            , 0														AS 공헌이익_CA                     
            , 0														AS 공헌이익_정상론                 
            , 0														AS 공헌이익_신판                   
            , 0														AS 공헌이익_기본                   
            , 0														AS 공헌이익율_일시불               
            , 0														AS 공헌이익율_할부                 
            , 0														AS 공헌이익율_CA                   
            , 0														AS 공헌이익율_정상론               
            , 0														AS 공헌이익율_신판                 
            , 0														AS 공헌이익율_기본			
            , SYSDATE													AS DM적재일시                      
            
 
        FROM  TEMPACRM_월개인본인회원실적합계       T1,
              TEMPACRM_대손비용                 T3,
              ACRM.CRM단가                      T4

       WHERE  T4.기준년월  = '$1'  ;

      COMMIT;

--call sp_dmjob('공헌이익');  -- 7



--     8) ACRM.공헌이익 테이블에 입금비용 UPDATE

      UPDATE  ACRM.공헌이익
    입금비용_일시불 := T1.청구비용_일시불 * T2.입금비용 / T2.청구비용
            , 입금비용_할부             = T1.청구비용_할부   * T2.입금비용 / T2.청구비용
            , 입금비용_CA               = T1.청구비용_CA     * T2.입금비용 / T2.청구비용
            , 입금비용_정상론           = T1.청구비용_정상론 * T2.입금비용 / T2.청구비용
            , 입금비용_신판             = T1.청구비용_신판   * T2.입금비용 / T2.청구비용
            , 입금비용_기본  		= T1.청구비용_기본   * T2.입금비용 / T2.청구비용
                                      
        FROM  ACRM.공헌이익      T1,  
              ACRM.CRM단가       T2
       WHERE  T1.기준년월  = T2.기준년월
         AND  T1.기준년월  = '$1'  ;

      COMMIT;

--call sp_dmjob('공헌이익');  -- 8



--     9) ACRM.공헌이익 테이블에 PROCESS비용/상품서비스비용 UPDATE

      UPDATE  ACRM.공헌이익
    PROCESS비용_일시불 := T1.승인비용_일시불  + T1.매입비용_일시불  + T1.청구비용_일시불 + T1.입금비용_일시불
            , PROCESS비용_할부    = T1.승인비용_할부    + T1.매입비용_할부    + T1.청구비용_할부   + T1.입금비용_할부  
            , PROCESS비용_CA      = T1.청구비용_CA      + T1.입금비용_CA    
            , PROCESS비용_정상론  = T1.청구비용_정상론  + T1.입금비용_정상론
            , PROCESS비용_신판    = T1.승인비용_일시불  + T1.매입비용_일시불 +T1.승인비용_할부 + T1.매입비용_할부 +T1.청구비용_신판 + T1.입금비용_신판  
            , PROCESS비용_기본    = T1.승인비용_일시불  + T1.매입비용_일시불 +T1.승인비용_할부 + T1.매입비용_할부 +T1.청구비용_기본 + T1.입금비용_기본
            , 상품서비스비용_일시불= T1.M포인트비용_일시불 + T1.마일리지비용_일시불 + T1.할인서비스_일시불 + T1.판촉서비스수수료_일시불 + T1.브랜드로열티_일시불
            , 상품서비스비용_할부  = T1.M포인트비용_할부   + T1.마일리지비용_할부   + T1.할인서비스_할부   + T1.판촉서비스수수료_할부   + T1.브랜드로열티_할부 
                                      
        FROM  ACRM.공헌이익      T1,  
              ACRM.CRM단가       T2
       WHERE  T1.기준년월  = T2.기준년월
         AND  T1.기준년월  = '$1'  ;

      COMMIT;

--call sp_dmjob('공헌이익');  -- 9



--     10) ACRM.공헌이익 테이블에 공헌이익 UPDATE

      UPDATE  ACRM.공헌이익
    공헌이익_일시불 := T1.가맹점수수료_일시불
                                           -  T1.금융비용_일시불        
                                           -  T1.PROCESS비용_일시불     
                                           -  T1.상품서비스비용_일시불  
                                           -  T1.대손충당비용_일시불        
            , 공헌이익_할부		=    (T1.가맹점수수료_할부 + T1.이용수수료_할부)
                                           -  T1.금융비용_할부                     
                                           -  T1.PROCESS비용_할부                  
                                           -  T1.상품서비스비용_할부               
                                           -  T1.대손충당비용_할부              
            , 공헌이익_CA       	=    (T1.취급수수료_CA         + T1.이용수수료_CA)
                                           -  T1.금융비용_CA             
                                           -  T1.PROCESS비용_CA          
                                           -  T1.브랜드로열티_CA         
                                           -  T1.대손충당비용_CA     
            , 공헌이익_정상론           =    (T1.취급수수료_정상론     + T1.이용수수료_정상론)
                                           -  T1.금융비용_정상론                 
                                           -  T1.PROCESS비용_정상론              
                                           -  T1.자금이체수수료_정상론           
                                           -  T1.대손충당비용_정상론
            , 공헌이익_신판             =    (T1.가맹점수수료_일시불 + T1.가맹점수수료_할부 + T1.이용수수료_할부)
                                           -  T1.금융비용_일시불    -  T1.금융비용_할부    
                                           -  T1.PROCESS비용_신판   -  T1.상품서비스비용_일시불   -  T1.상품서비스비용_할부
                                           -  T1.대손충당비용_일시불   -  T1.대손충당비용_할부 
            , 공헌이익_기본		=    (T1.가맹점수수료_일시불 + T1.가맹점수수료_할부 + T1.이용수수료_할부
            					+ T1.취급수수료_CA         + T1.이용수수료_CA)
                                           -  T1.금융비용_일시불   -  T1.금융비용_할부   -  T1.금융비용_CA      
                                           -  T1.PROCESS비용_기본     
                                           -  T1.상품서비스비용_일시불 -  T1.상품서비스비용_할부 -  T1.브랜드로열티_CA 
                                           -  T1.대손충당비용_일시불    -  T1.대손충당비용_할부 -  T1.대손충당비용_CA       
                         		     
         
        FROM  ACRM.공헌이익      T1 
       WHERE  T1.기준년월 = '$1' ;

      COMMIT;
      
--call sp_dmjob('공헌이익');  -- 10 



--     11) ACRM.공헌이익 테이블에 공헌이익 UPDATE

      UPDATE  ACRM.공헌이익
    공헌이익율_일시불 := T1.공헌이익_일시불 /  T1.이용금액_개인_일시불                                        	
            , 공헌이익율_할부		= T1.공헌이익_할부   /  T1.이용금액_개인_할부                                                 
            , 공헌이익율_CA             = T1.공헌이익_CA     /  T1.이용금액_개인_CA                                                   
            , 공헌이익율_정상론         = T1.공헌이익_정상론 /  T1.이용금액_개인_정상론                                               
            , 공헌이익율_신판		= T1.공헌이익_신판   / (T1.이용금액_개인_일시불 + T1.이용금액_개인_할부)                      
            , 공헌이익율_기본		= T1.공헌이익_기본   / (T1.이용금액_개인_일시불 + T1.이용금액_개인_할부 + T1.이용금액_개인_CA)
         
        FROM  ACRM.공헌이익      T1 
       WHERE  T1.기준년월 = '$1' ;

      COMMIT;


--call sp_dmjob('공헌이익','E');

/*--------------------------------------------------------------------------------------*/
/*     End of  PROGRAM                                                                  */
/*--------------------------------------------------------------------------------------*/      